// --- ข้อมูลข่าวสาร (News Database) ---
const newsData = [
    { 
        id: 'n2', 
        title: "📣 ประกาศผลการประกวดคลิปวิดีโอสั้น “โตไปไม่สูบ” หัวข้อ ควันบุหรี่ใกล้ตัว", 
        date: "10 ม.ค. 69", 
        images: [
            "img/D25A83CF-6E88-4442-8F77-0373AE024DA0.jpg","img/1FB7E55F-9452-4FEC-ABDA-633375F28B42.jpg"
        ], 
        summary: "สารวัตรนักเรียนไซเบอร์ โรงเรียนเตรียมอุดมศึกษาภาคใต้ ร่วมกับศูนย์สร้างสรรค์สื่อเพื่อเด็ก เยาวชน และครอบครัว ภายใต้การสนับสนุนจาก สสส. \nขอขอบคุณนักเรียนทุกทีมที่ส่งผลงานเข้าร่วมการประกวด ทุกคลิปสะท้อนความคิดสร้างสรรค์ และความตระหนักรู้เรื่องภัยใกล้ตัวได้อย่างน่าสนใจ 💙 \n✨ ขอแสดงความยินดีกับทีมที่ได้รับรางวัลทุกทีม ✨ สามารถตรวจสอบรายชื่อผู้ได้รับรางวัลได้จากภาพประกาศนี้ \n📍 การมอบเกียรติบัตรและของรางวัล วันที่ 19 มกราคม 2568 \nณ หอประชุม โรงเรียนเตรียมอุดมศึกษาภาคใต้" 
    }
];

// --- ข้อมูลกิจกรรม (Activities Database) ---
// readMoreLink: ลิ้งค์สำหรับปุ่ม "อ่านรายละเอียดเพิ่มเติม" (เช่น ไฟล์ PDF ระเบียบการ)
// registerLink: ลิ้งค์สำหรับปุ่ม "สมัครเข้าร่วมกิจกรรม" (เช่น Google Forms)
// buttonText: ข้อความบนปุ่มสมัคร (Optional)
const activityData = [
    { 
        id: 'a1',
        type: 'recruitment',
        status: 'closed',    // ตัวอย่าง: ปิดรับสมัครแล้ว
        title: "ประกวดคลิปวิดีโอสั้น 🎬✨ “ควันบุหรี่ใกล้ตัว”", 
        images: [
            "img/1.png",
            "img/3.png",
            "img/4.png",
            "img/5.png",
            "img/6.png"
        ], 
        applyDate: "6 ธ.ค.68 - 4 ม.ค.69", 
        description: "แกนนำโตไปไม่สูบ โรงเรียนเตรียมอุดมศึกษาภาคใต้ ร่วมกับศูนย์สร้างสรรค์สื่อเพื่อเด็กเยาวชนและครอบครัว และสำนักงานกองทุนสนับสนุนการสร้างเสริมสุขภาพ (สสส.)\n ชวนชาว ม.ปลาย รร.เตรียมอุดมศึกษาภาคใต้ มาร่วมเล่าเรื่องผ่านคลิปวิดีโอความยาวไม่เกิน 3 นาที \nในหัวข้อ 🔥 “ควันบุหรี่ใกล้ตัว” จะจริงจัง ตลก แง่คิด สร้างสรรค์ได้หมด! ", 
        criteria: "1. ระดับชั้น ม.4-6 โรงเรียนเตรียมอุดมศึกษาภาคใต้\n2. ทีมผู้สมัครจะต้องมีสมาชิกในทีม 4 คน", 
        // ลิ้งค์สำหรับปุ่ม 'อ่านรายละเอียดเพิ่มเติม'
        readMoreLink: "https://drive.google.com/file/d/1jwRUQRipz3hVgcxJlCGo24hAb8aiEJoK/view?usp=sharing", 
        // ลิ้งค์สำหรับปุ่ม 'สมัครเข้าร่วม'
        registerLink: "https://docs.google.com/forms/d/e/1FAIpQLSdBUC0oP9BnbUg_H6YVu7y37Sup64p3764X6HyqDWsXaY9JEQ/viewform?pli=1&fbclid=IwY2xjawPA1ohleHRuA2FlbQIxMABicmlkETEyVnptNnZUMUNaZzY3WGZsc3J0YwZhcHBfaWQQMjIyMDM5MTc4ODIwMDg5MgABHnibohf100MKkgpOwjOexcZFT_I7eSASWuiNDbWzTrz36Wl3oETt6zozzSW2_aem_fpkaMeLreKbvJJo-G98LKw", 
        buttonText: "สมัครเข้าร่วม",
        summary: "ชวนชาว ม.ปลาย เล่าเรื่องผ่านคลิปวิดี 3 นาที ในหัวข้อ 🔥“ควันบุหรี่ใกล้ตัว”" 
    },
    { 
        id: 'a3', 
        type: 'recruitment',
        status: 'closed',    // ตัวอย่าง: ปิดรับสมัครแล้ว
        title: "สร้างสรรค์ Infographic ”Stay Lit, Don‘t Smoke“ 🚫🚬", 
        images: [
            "img/560500532_122117244536989185_6055050141498744594_n.jpg",
            "img/558907541_122117244620989185_8509854083374649959_n.jpg",
            "img/561739645_122117244584989185_5339656944943668675_n.jpg"
        ], 
        applyDate: "10 - 20 ต.ค. 68", 
        description: "🚗💨💨มาแล้วจร้าาขอเชิญเพื่อนๆ พี่ๆ น้องๆที่มีใจรักในการออกแบบ โรงเรียนเตรียมอุดมศึกษาภาคใต้ ร่วมกับศูนย์สร้างสรรค์สื่อเพื่อเด็กเยาวชนและครอบครัว และสำนักงานกองทุนสนับสนุนการสร้างเสริมสุขภาพ (สสส.) จัดกิจกรรมสร้างสรรค์ Infographic ภายใต้แคมเปญ โตไปไม่สูบ หัวข้อ ”Stay Lit, Don‘t Smoke“ 🚫🚬🚫 โดยแกนนำโตไปไม่สูบ สารวัตรนักเรียนไซเบอร์โรงเรียนเตรียมอุดมศึกษาภาคใต้", 
        criteria: "1. ระดับชั้น ม.4-6 โรงเรียนเตรียมอุดมศึกษาภาคใต้", 
        readMoreLink: "",
        registerLink: "",
        buttonText: "สมัครเข้าร่วม",
        summary: "🚗💨💨มาแล้วจร้าาขอเชิญเพื่อนๆ พี่ๆ น้องๆที่มีใจรักในการออกแบบ" 
    },

];